Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_fmac.h
/*
 * SPDX-License-Identifier: MIT
 *
 * Goal:     stm32V873_fmac equates.
 */
#pragma once

#include    <stdint.h>

// FMAC address definitions
// ------------------------

typedef struct {
    volatile    uint32_t    X1BUFCFG;
    volatile    uint32_t    X2BUFCFG;
    volatile    uint32_t    YBUFCFG;
    volatile    uint32_t    PARAM;
    volatile    uint32_t    CR;
    volatile    uint32_t    SR;
    volatile    uint32_t    WDATA;
    volatile    uint32_t    RDATA;
} FMAC_TypeDef;

#if (defined(__cplusplus))
#define FMAC_NS     reinterpret_cast<FMAC_TypeDef *>(0x42024000u)
#define FMAC_S      reinterpret_cast<FMAC_TypeDef *>(0x52024000u)

#else
#define FMAC_NS     ((FMAC_TypeDef *)0x42024000u)
#define FMAC_S      ((FMAC_TypeDef *)0x52024000u)
#endif

// X1BUFCFG Configuration

#define FMAC_X1BUFCFG_FULL_WM           (0x3u<<24)
#define FMAC_X1BUFCFG_FULL_WM_0         (0x1u<<24)
#define FMAC_X1BUFCFG_X1_BUF_SIZE       (0xFFu<<8)
#define FMAC_X1BUFCFG_X1_BUF_SIZE_0     (0x1u<<8)
#define FMAC_X1BUFCFG_X1_BASE           (0xFFu<<0)
#define FMAC_X1BUFCFG_X1_BASE_0         (0x1u<<0)

#define FMAC_X1BUFCFG_FULL_WM_B_0X0     (0x0u<<24)
#define FMAC_X1BUFCFG_FULL_WM_B_0X1     (0x1u<<24)

// X2BUFCFG Configuration

#define FMAC_X2BUFCFG_X2_BUF_SIZE       (0xFFu<<8)
#define FMAC_X2BUFCFG_X2_BUF_SIZE_0     (0x1u<<8)
#define FMAC_X2BUFCFG_X2_BASE           (0xFFu<<0)
#define FMAC_X2BUFCFG_X2_BASE_0         (0x1u<<0)

// YBUFCFG Configuration

#define FMAC_YBUFCFG_EMPTY_WM           (0x3u<<24)
#define FMAC_YBUFCFG_EMPTY_WM_0         (0x1u<<24)
#define FMAC_YBUFCFG_Y_BUF_SIZE         (0xFFu<<8)
#define FMAC_YBUFCFG_Y_BUF_SIZE_0       (0x1u<<8)
#define FMAC_YBUFCFG_Y_BASE             (0xFFu<<0)
#define FMAC_YBUFCFG_Y_BASE_0           (0x1u<<0)

#define FMAC_YBUFCFG_EMPTY_WM_B_0X0     (0x0u<<24)
#define FMAC_YBUFCFG_EMPTY_WM_B_0X1     (0x1u<<24)

// PARAM Configuration

#define FMAC_PARAM_START                (0x1u<<31)
#define FMAC_PARAM_FUNC                 (0x7Fu<<24)
#define FMAC_PARAM_FUNC_0               (0x1u<<24)
#define FMAC_PARAM_R                    (0xFFu<<16)
#define FMAC_PARAM_R_0                  (0x1u<<16)
#define FMAC_PARAM_Q                    (0xFFu<<8)
#define FMAC_PARAM_Q_0                  (0x1u<<8)
#define FMAC_PARAM_P                    (0xFFu<<0)
#define FMAC_PARAM_P_0                  (0x1u<<0)

#define FMAC_PARAM_START_B_0X0          (0x0u<<31)
#define FMAC_PARAM_START_B_0X1          (0x1u<<31)
#define FMAC_PARAM_FUNC_B_0X1           (0x1u<<24)

// CR Configuration

#define FMAC_CR_RESET                   (0x1u<<16)
#define FMAC_CR_CLIPEN                  (0x1u<<15)
#define FMAC_CR_DMAWEN                  (0x1u<<9)
#define FMAC_CR_DMAREN                  (0x1u<<8)
#define FMAC_CR_SATIEN                  (0x1u<<4)
#define FMAC_CR_UNFLIEN                 (0x1u<<3)
#define FMAC_CR_OVFLIEN                 (0x1u<<2)
#define FMAC_CR_WIEN                    (0x1u<<1)
#define FMAC_CR_RIEN                    (0x1u<<0)

#define FMAC_CR_RESET_B_0X0             (0x0u<<16)
#define FMAC_CR_RESET_B_0X1             (0x1u<<16)
#define FMAC_CR_CLIPEN_B_0X0            (0x0u<<15)
#define FMAC_CR_CLIPEN_B_0X1            (0x1u<<15)
#define FMAC_CR_DMAWEN_B_0X0            (0x0u<<9)
#define FMAC_CR_DMAWEN_B_0X1            (0x1u<<9)
#define FMAC_CR_DMAREN_B_0X0            (0x0u<<8)
#define FMAC_CR_DMAREN_B_0X1            (0x1u<<8)
#define FMAC_CR_SATIEN_B_0X0            (0x0u<<4)
#define FMAC_CR_SATIEN_B_0X1            (0x1u<<4)
#define FMAC_CR_UNFLIEN_B_0X0           (0x0u<<3)
#define FMAC_CR_UNFLIEN_B_0X1           (0x1u<<3)
#define FMAC_CR_OVFLIEN_B_0X0           (0x0u<<2)
#define FMAC_CR_OVFLIEN_B_0X1           (0x1u<<2)
#define FMAC_CR_WIEN_B_0X0              (0x0u<<1)
#define FMAC_CR_WIEN_B_0X1              (0x1u<<1)
#define FMAC_CR_RIEN_B_0X0              (0x0u<<0)
#define FMAC_CR_RIEN_B_0X1              (0x1u<<0)

// SR Configuration

#define FMAC_SR_SAT                     (0x1u<<10)
#define FMAC_SR_UNFL                    (0x1u<<9)
#define FMAC_SR_OVFL                    (0x1u<<8)
#define FMAC_SR_X1FULL                  (0x1u<<1)
#define FMAC_SR_YEMPTY                  (0x1u<<0)

#define FMAC_SR_SAT_B_0X0               (0x0u<<10)
#define FMAC_SR_SAT_B_0X1               (0x1u<<10)
#define FMAC_SR_UNFL_B_0X0              (0x0u<<9)
#define FMAC_SR_UNFL_B_0X1              (0x1u<<9)
#define FMAC_SR_OVFL_B_0X0              (0x0u<<8)
#define FMAC_SR_OVFL_B_0X1              (0x1u<<8)
#define FMAC_SR_X1FULL_B_0X0            (0x0u<<1)
#define FMAC_SR_X1FULL_B_0X1            (0x1u<<1)
#define FMAC_SR_YEMPTY_B_0X0            (0x0u<<0)
#define FMAC_SR_YEMPTY_B_0X1            (0x1u<<0)

// WDATA Configuration

#define FMAC_WDATA_WDATA                (0xFFFFu<<0)
#define FMAC_WDATA_WDATA_0              (0x1u<<0)

// RDATA Configuration

#define FMAC_RDATA_RDATA                (0xFFFFu<<0)
#define FMAC_RDATA_RDATA_0              (0x1u<<0)
